@echo off
REM Даты, которые нужно "закрасить". Формат: YYYY-MM-DD
setlocal EnableDelayedExpansion

set dates="2024-01-01 2024-01-05 2024-01-06 2024-01-08 2024-01-11 2024-01-13 2024-01-15 2024-01-17 2024-01-20 2024-01-22 2024-01-23 2024-01-27 2024-02-06 2024-02-07 2024-02-08 2024-02-09 2024-02-12 2024-02-17 2024-02-19 2024-02-24 2024-02-27 2024-02-28 2024-02-29 2024-03-01 2024-03-11 2024-03-12 2024-03-13 2024-03-14 2024-03-15 2024-03-16 2024-03-18 2024-03-21"

git add pixel.txt  REM Добавляем pixel.txt под контроль Git

for %%a in (%dates%) do (
    echo Создаем коммит для даты: %%a
    echo %%a >> pixel.txt
    git add pixel.txt
    git commit -m "Pixel art commit" --date "%%a"
    type nul > pixel.txt
)

endlocal